# Importing Libraries

In [44]:
import pandas as pd 
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# Load Data

In [45]:
movies_df = pd.read_csv('Dataset/movies.csv', names=['movieId','title'])
rating_df = pd.read_csv('Dataset/ratings.csv', names=['userId','movieId','rating'])

# Prepare the Movies Data Frame

In [46]:
movies_df = movies_df.iloc[1:]
movies_df.head(3)

  movieId                    title
1       1         Toy Story (1995)
2       2           Jumanji (1995)
3       3  Grumpier Old Men (1995)

# Prepare the Ratings Data Frame

In [47]:
rating_df = rating_df.iloc[1:]
rating_df.head(3)

  userId movieId rating
1      1     307    3.5
2      1     481    3.5
3      1    1091    1.5

# Merging the Two Data Frames

In [48]:
df = pd.merge(movies_df, rating_df, on='movieId')
df = df.iloc[1:]
df.head(3)

  movieId             title userId rating
1       1  Toy Story (1995)     10      5
2       1  Toy Story (1995)     14    4.5
3       1  Toy Story (1995)     15      4

# Brief description of our dataset

In [49]:
df.describe()

       movieId                title  userId  rating
count   262142               262142  262142  262142
unique   14909                14906    2566      10
top        356  Forrest Gump (1994)    2025       4
freq       897                  897    3238   67858

Correlation is a statistical measure that indicates the extent to which two or more variables fluctuate together. Movies that have a high correlation coefficient are the movies that are most similar to each other. In our case we shall use the Pearson correlation coefficient. This number will lie between -1 and 1. 1 indicates a positive linear correlation while -1 indicates a negative correlation. 0 indicates no linear correlation. Therefore movies with a zero correlation are not similar at all.

In [50]:
df.dtypes

movieId    object
title      object
userId     object
rating     object
dtype: object

I noticed that the data type of rating is an Object, so i needed to convert it into float in order to some calculations on it.

In [51]:
df['rating'] = df['rating'].astype(float)
df.dtypes

movieId     object
title       object
userId      object
rating     float64
dtype: object

# Group the dataset by the title column and compute its mean to obtain the average rating for each movie

In [52]:
ratings = pd.DataFrame(df.groupby('title')['rating'].mean())
ratings.head(10)

                                           rating
title
#Horror (2015)                           1.000000
$ (Dollars) (1971)                       3.000000
$5 a Day (2008)                          1.750000
'71 (2014)                               3.500000
'Hellboy': The Seeds of Creation (2004)  3.500000
'Round Midnight (1986)                   4.166667
'Salem's Lot (2004)                      4.000000
'Til There Was You (1997)                2.833333
'Twas the Night Before Christmas (1974)  3.000000
'burbs, The (1989)                       2.940476

# Number of ratings for each movie.

Saving it by creating a number of ratings column

In [53]:
ratings['number of ratings'] = df.groupby('title')['rating'].count()
ratings.head()

                                         rating  number of ratings
title
#Horror (2015)                             1.00                  1
$ (Dollars) (1971)                         3.00                  1
$5 a Day (2008)                            1.75                  2
'71 (2014)                                 3.50                  5
'Hellboy': The Seeds of Creation (2004)    3.50                  4